{"config": {"layers": [{"config": {"filters": 24, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "batch_input_shape": [null, 66, 200, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"filters": 36, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "batch_input_shape": [null, 31, 98, 24], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"filters": 48, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "batch_input_shape": [null, 14, 47, 36], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "batch_input_shape": [null, 5, 22, 48], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "batch_input_shape": [null, 3, 20, 64], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "units": 1164, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_4", "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_5", "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}