{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_1", "batch_input_shape": [null, 66, 200, 3], "use_bias": true, "kernel_constraint": null, "activation": "relu", "trainable": true, "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_2", "batch_input_shape": [null, 31, 98, 24], "use_bias": true, "kernel_constraint": null, "activation": "relu", "trainable": true, "filters": 36, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_3", "batch_input_shape": [null, 14, 47, 36], "use_bias": true, "kernel_constraint": null, "activation": "relu", "trainable": true, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_4", "batch_input_shape": [null, 5, 22, 48], "use_bias": true, "kernel_constraint": null, "activation": "relu", "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_5", "batch_input_shape": [null, 3, 20, 64], "use_bias": true, "kernel_constraint": null, "activation": "relu", "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1164, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 100, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_2", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 50, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_3", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_4", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_5", "use_bias": true, "bias_constraint": null}}], "name": "sequential_1"}}