{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "filters": 24, "strides": [2, 2], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "name": "conv2d_1", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "filters": 36, "strides": [2, 2], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 31, 98, 24], "name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "filters": 48, "strides": [2, 2], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 14, 47, 36], "name": "conv2d_3", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "filters": 64, "strides": [1, 1], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 5, 22, 48], "name": "conv2d_4", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "filters": 64, "strides": [1, 1], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 3, 20, 64], "name": "conv2d_5", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "units": 1164, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "units": 100, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "units": 50, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "units": 10, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_5", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}], "name": "sequential_1"}, "backend": "tensorflow"}