{"config": {"layers": [{"config": {"padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 32, 128, 3], "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "name": "conv2d_1", "filters": 16, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "name": "conv2d_2", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "name": "conv2d_3", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 500, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 100, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 20, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}