{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"filters": 24, "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 66, 200, 3], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"filters": 36, "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 31, 98, 24], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"filters": 48, "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 14, 47, 36], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 5, 22, 48], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 3, 20, 64], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "units": 1164, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "units": 100, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_constraint": null, "units": 50, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "kernel_constraint": null, "units": 10, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_5", "bias_constraint": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}